In [2]:
import pandas as pd

In [4]:
# Carregando a base de dados do Titanic
df_titanic = pd.read_csv('titanic.csv')

In [20]:
# Exibindo as primeiras 5 linhas do DataFrame
print(df_titanic.head().to_markdown(index=False, numalign="left", stralign="left"))

| PassengerId   | Survived   | Pclass   | Name                                         | Sex    | Age   | SibSp   | Parch   | Ticket   | Fare    | Cabin   | Embarked   | Fare_BRL   |
|:--------------|:-----------|:---------|:---------------------------------------------|:-------|:------|:--------|:--------|:---------|:--------|:--------|:-----------|:-----------|
| 892           | 0          | 3        | Kelly, Mr. James                             | male   | 34.5  | 0       | 0       | 330911   | 7.8292  | nan     | Q          | 39.146     |
| 893           | 1          | 3        | Wilkes, Mrs. James (Ellen Needs)             | female | 47    | 1       | 0       | 363272   | 7       | nan     | S          | 35         |
| 894           | 0          | 2        | Myles, Mr. Thomas Francis                    | male   | 62    | 0       | 0       | 240276   | 9.6875  | nan     | Q          | 48.4375    |
| 895           | 0          | 3        | Wirz, Mr. Albert                             | male   | 27    | 0       | 0       | 315154   | 8.6625  | nan     | S          | 43.3125    |
| 896           | 1          | 3        | Hirvonen, Mrs. Alexander (Helga E Lindqvist) | female | 22    | 1       | 1       | 3101298  | 12.2875 | nan     | S          | 61.4375    |

In [21]:
# Calculando a taxa de sobrevivência por sexo
taxa_sobrevivencia_sexo = df_titanic.groupby('Sex')['Survived'].mean()
print(taxa_sobrevivencia_sexo)

Sex
female    1.0
male      0.0
Name: Survived, dtype: float64

In [22]:
# Calculando a média da tarifa paga por passageiros em cada classe
media_tarifa_classe = df_titanic.groupby('Pclass')['Fare'].mean()
print(media_tarifa_classe)

Pclass
1    94.280297
2    22.202104
3    12.459678
Name: Fare, dtype: float64

In [27]:
# Determinando a distribuição da idade dos passageiros
distribuicao_idade = df_titanic['Age'].describe()
print(distribuicao_idade)

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [17]:
# Exibindo informações sobre as colunas e seus tipos
print(df_titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
 12  Fare_BRL     417 non-null    float64
dtypes: float64(3), int64(5), object(5)
memory usage: 42.6+ KB
None

In [28]:
# Encontrando o ponto de embarque mais comum
ponto_embarque_comum = df_titanic['Embarked'].mode()
print(ponto_embarque_comum)

0    S
Name: Embarked, dtype: object

In [9]:
# Calculando a média da idade dos passageiros
media_idade = df_titanic['Age'].mean()
print(f'Média de idade dos passageiros: {media_idade:.2f}')

Média de idade dos passageiros: 30.27

In [10]:
# Contando o número de passageiros por classe
contagem_classe = df_titanic['Pclass'].value_counts()
print('\nNúmero de passageiros por classe:')
print(contagem_classe.to_markdown(numalign="left", stralign="left"))

Número de passageiros por classe:
| Pclass   | count   |
|:---------|:--------|
| 3        | 218     |
| 1        | 107     |
| 2        | 93      |

In [13]:
# Criando uma nova coluna com a tarifa em reais (assumindo uma taxa de câmbio de 5.0)
df_titanic['Fare_BRL'] = df_titanic['Fare'] * 5.0

In [14]:
# Exibindo as primeiras 5 linhas do DataFrame com a nova coluna
print(df_titanic.head().to_markdown(index=False, numalign="left", stralign="left"))

| PassengerId   | Survived   | Pclass   | Name                                         | Sex    | Age   | SibSp   | Parch   | Ticket   | Fare    | Cabin   | Embarked   | Fare_BRL   |
|:--------------|:-----------|:---------|:---------------------------------------------|:-------|:------|:--------|:--------|:---------|:--------|:--------|:-----------|:-----------|
| 892           | 0          | 3        | Kelly, Mr. James                             | male   | 34.5  | 0       | 0       | 330911   | 7.8292  | nan     | Q          | 39.146     |
| 893           | 1          | 3        | Wilkes, Mrs. James (Ellen Needs)             | female | 47    | 1       | 0       | 363272   | 7       | nan     | S          | 35         |
| 894           | 0          | 2        | Myles, Mr. Thomas Francis                    | male   | 62    | 0       | 0       | 240276   | 9.6875  | nan     | Q          | 48.4375    |
| 895           | 0          | 3        | Wirz, Mr. Albert                             | male   | 27    | 0       | 0       | 315154   | 8.6625  | nan     | S          | 43.3125    |
| 896           | 1          | 3        | Hirvonen, Mrs. Alexander (Helga E Lindqvist) | female | 22    | 1       | 1       | 3101298  | 12.2875 | nan     | S          | 61.4375    |

In [15]:
# Filtrando passageiros que sobreviveram
sobreviventes = df_titanic[df_titanic['Survived'] == 1]
print(f'\nNúmero de sobreviventes: {len(sobreviventes)}')

Número de sobreviventes: 152

In [16]:
# Agrupando os passageiros por sexo e calculando a média da idade
media_idade_por_sexo = df_titanic.groupby('Sex')['Age'].mean()
print('\nMédia de idade por sexo:')
print(media_idade_por_sexo.to_markdown(numalign="left", stralign="left"))

Média de idade por sexo:
| Sex    | Age     |
|:-------|:--------|
| female | 30.2724 |
| male   | 30.2727 |